app/controllers/songs_controller.rb

  def new
    if params[:artist_id]
      artist = Artist.find_by(id: params[:artist_id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @song = Song.find(params[:id])
    puts song_params
    @song.update(song_params)
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 9]]
UPDATE "songs" SET "title" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["title", "jenny2"], ["updated_at", "2017-11-08 18:45:40.191260"], ["id", 9]]